frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/crccu.h
#define CRCCU_IER_OFFSET            0x40         /**< \brief (CRCCU_IER offset) Interrupt Enable Register */
#define CRCCU_IER_RESETVALUE        _U(0x00000000); /**< \brief (CRCCU_IER reset_value) Interrupt Enable Register */

#define CRCCU_IER_ERRIER_Pos        0            /**< \brief (CRCCU_IER) CRC Error Interrupt Enable */
#define CRCCU_IER_ERRIER            (_U(0x1) << CRCCU_IER_ERRIER_Pos)
#define CRCCU_IER_MASK              _U(0x00000001) /**< \brief (CRCCU_IER) MASK Register */

/* -------- CRCCU_IDR : (CRCCU Offset: 0x44) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ERRIDR:1;         /*!< bit:      0  CRC Error Interrupt Disable        */
    uint32_t :31;              /*!< bit:  1..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CRCCU_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CRCCU_IDR_OFFSET            0x44         /**< \brief (CRCCU_IDR offset) Interrupt Disable Register */
#define CRCCU_IDR_RESETVALUE        _U(0x00000000); /**< \brief (CRCCU_IDR reset_value) Interrupt Disable Register */

#define CRCCU_IDR_ERRIDR_Pos        0            /**< \brief (CRCCU_IDR) CRC Error Interrupt Disable */
#define CRCCU_IDR_ERRIDR            (_U(0x1) << CRCCU_IDR_ERRIDR_Pos)
#define CRCCU_IDR_MASK              _U(0x00000001) /**< \brief (CRCCU_IDR) MASK Register */

/* -------- CRCCU_IMR : (CRCCU Offset: 0x48) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ERRIMR:1;         /*!< bit:      0  CRC Error Interrupt Mask           */
    uint32_t :31;              /*!< bit:  1..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CRCCU_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CRCCU_IMR_OFFSET            0x48         /**< \brief (CRCCU_IMR offset) Interrupt Mask Register */
#define CRCCU_IMR_RESETVALUE        _U(0x00000000); /**< \brief (CRCCU_IMR reset_value) Interrupt Mask Register */

#define CRCCU_IMR_ERRIMR_Pos        0            /**< \brief (CRCCU_IMR) CRC Error Interrupt Mask */
#define CRCCU_IMR_ERRIMR            (_U(0x1) << CRCCU_IMR_ERRIMR_Pos)
#define CRCCU_IMR_MASK              _U(0x00000001) /**< \brief (CRCCU_IMR) MASK Register */

/* -------- CRCCU_ISR : (CRCCU Offset: 0x4C) (R/  32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ERRISR:1;         /*!< bit:      0  CRC Error Interrupt Status         */
    uint32_t :31;              /*!< bit:  1..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CRCCU_ISR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CRCCU_ISR_OFFSET            0x4C         /**< \brief (CRCCU_ISR offset) Interrupt Status Register */
#define CRCCU_ISR_RESETVALUE        _U(0x00000000); /**< \brief (CRCCU_ISR reset_value) Interrupt Status Register */

#define CRCCU_ISR_ERRISR_Pos        0            /**< \brief (CRCCU_ISR) CRC Error Interrupt Status */
#define CRCCU_ISR_ERRISR            (_U(0x1) << CRCCU_ISR_ERRISR_Pos)
#define CRCCU_ISR_MASK              _U(0x00000001) /**< \brief (CRCCU_ISR) MASK Register */

/* -------- CRCCU_VERSION : (CRCCU Offset: 0xFC) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version Number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant Number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CRCCU_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CRCCU_VERSION_OFFSET        0xFC         /**< \brief (CRCCU_VERSION offset) Version Register */
#define CRCCU_VERSION_RESETVALUE    _U(0x00000202); /**< \brief (CRCCU_VERSION reset_value) Version Register */

#define CRCCU_VERSION_VERSION_Pos   0            /**< \brief (CRCCU_VERSION) Version Number */
#define CRCCU_VERSION_VERSION_Msk   (_U(0xFFF) << CRCCU_VERSION_VERSION_Pos)
#define CRCCU_VERSION_VERSION(value) (CRCCU_VERSION_VERSION_Msk & ((value) << CRCCU_VERSION_VERSION_Pos))
#define CRCCU_VERSION_VARIANT_Pos   16           /**< \brief (CRCCU_VERSION) Variant Number */
#define CRCCU_VERSION_VARIANT_Msk   (_U(0xF) << CRCCU_VERSION_VARIANT_Pos)
#define CRCCU_VERSION_VARIANT(value) (CRCCU_VERSION_VARIANT_Msk & ((value) << CRCCU_VERSION_VARIANT_Pos))
#define CRCCU_VERSION_MASK          _U(0x000F0FFF) /**< \brief (CRCCU_VERSION) MASK Register */

/** \brief CRCCU hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO CRCCU_DSCR_Type           DSCR;        /**< \brief Offset: 0x00 (R/W 32) Descriptor Base Register */
       RoReg8                    Reserved1[0x4];
  __O  CRCCU_DMAEN_Type          DMAEN;       /**< \brief Offset: 0x08 ( /W 32) DMA Enable Register */
  __O  CRCCU_DMADIS_Type         DMADIS;      /**< \brief Offset: 0x0C ( /W 32) DMA Disable Register */
  __I  CRCCU_DMASR_Type          DMASR;       /**< \brief Offset: 0x10 (R/  32) DMA Status Register */
  __O  CRCCU_DMAIER_Type         DMAIER;      /**< \brief Offset: 0x14 ( /W 32) DMA Interrupt Enable Register */
  __O  CRCCU_DMAIDR_Type         DMAIDR;      /**< \brief Offset: 0x18 ( /W 32) DMA Interrupt Disable Register */
  __I  CRCCU_DMAIMR_Type         DMAIMR;      /**< \brief Offset: 0x1C (R/  32) DMA Interrupt Mask Register */
  __I  CRCCU_DMAISR_Type         DMAISR;      /**< \brief Offset: 0x20 (R/  32) DMA Interrupt Status Register */
       RoReg8                    Reserved2[0x10];
  __O  CRCCU_CR_Type             CR;          /**< \brief Offset: 0x34 ( /W 32) Control Register */
  __IO CRCCU_MR_Type             MR;          /**< \brief Offset: 0x38 (R/W 32) Mode Register */
  __I  CRCCU_SR_Type             SR;          /**< \brief Offset: 0x3C (R/  32) Status Register */
  __O  CRCCU_IER_Type            IER;         /**< \brief Offset: 0x40 ( /W 32) Interrupt Enable Register */
  __O  CRCCU_IDR_Type            IDR;         /**< \brief Offset: 0x44 ( /W 32) Interrupt Disable Register */
  __I  CRCCU_IMR_Type            IMR;         /**< \brief Offset: 0x48 (R/  32) Interrupt Mask Register */
  __I  CRCCU_ISR_Type            ISR;         /**< \brief Offset: 0x4C (R/  32) Interrupt Status Register */
       RoReg8                    Reserved3[0xAC];
  __I  CRCCU_VERSION_Type        VERSION;     /**< \brief Offset: 0xFC (R/  32) Version Register */
 } bf;
 struct {
  RwReg   CRCCU_DSCR;         /**< \brief (CRCCU Offset: 0x00) Descriptor Base Register */
  RoReg8  Reserved4[0x4];
  WoReg   CRCCU_DMAEN;        /**< \brief (CRCCU Offset: 0x08) DMA Enable Register */
  WoReg   CRCCU_DMADIS;       /**< \brief (CRCCU Offset: 0x0C) DMA Disable Register */
  RoReg   CRCCU_DMASR;        /**< \brief (CRCCU Offset: 0x10) DMA Status Register */
  WoReg   CRCCU_DMAIER;       /**< \brief (CRCCU Offset: 0x14) DMA Interrupt Enable Register */
  WoReg   CRCCU_DMAIDR;       /**< \brief (CRCCU Offset: 0x18) DMA Interrupt Disable Register */
  RoReg   CRCCU_DMAIMR;       /**< \brief (CRCCU Offset: 0x1C) DMA Interrupt Mask Register */
  RoReg   CRCCU_DMAISR;       /**< \brief (CRCCU Offset: 0x20) DMA Interrupt Status Register */
  RoReg8  Reserved5[0x10];
  WoReg   CRCCU_CR;           /**< \brief (CRCCU Offset: 0x34) Control Register */
  RwReg   CRCCU_MR;           /**< \brief (CRCCU Offset: 0x38) Mode Register */
  RoReg   CRCCU_SR;           /**< \brief (CRCCU Offset: 0x3C) Status Register */
  WoReg   CRCCU_IER;          /**< \brief (CRCCU Offset: 0x40) Interrupt Enable Register */
  WoReg   CRCCU_IDR;          /**< \brief (CRCCU Offset: 0x44) Interrupt Disable Register */
  RoReg   CRCCU_IMR;          /**< \brief (CRCCU Offset: 0x48) Interrupt Mask Register */
  RoReg   CRCCU_ISR;          /**< \brief (CRCCU Offset: 0x4C) Interrupt Status Register */
  RoReg8  Reserved6[0xAC];
  RoReg   CRCCU_VERSION;      /**< \brief (CRCCU Offset: 0xFC) Version Register */
 } reg;
} Crccu;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_CRCCU_COMPONENT_ */
